iq32-sdr/Source/STM32-SDR/code/guiDrivers/src/LcdDriver_ILI9320.c
/*
 * Code for LCD Driver for ILI9320 chip
 *
 * STM32-SDR: A software defined HAM radio embedded system.
 * Copyright (C) 2013, STM32-SDR Group
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 */


#include <assert.h>
#include <stdlib.h>
#include "stm32_eval.h"
#include "LcdDriver_ILI9320.h"
#include "sdr_image.h"
//example error correction
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_exti.h"
#include "misc.h"
#include "stm32f4xx_tim.h"
#include "stm32f4xx_syscfg.h"
#include "stm32f4xx_fsmc.h"
#include "xprintf.h"

// *********************************************************************************
// Register Settings for LCD
// *********************************************************************************
// LCD Selection:
#define LCD_ILI9320  0x9320
#define LCD_SSD1289  0x8989
#define LCD_SSD1289_ALT2 0x8889
#define LCD_ILI9325  0x9325
#define LCD_ILI9328  0x9328
#define LCD_SSD1289_ALT1  0x1289	              // Older value: default to using standard SSD1289 code when found.
static uint16_t s_currentLCD = LCD_ILI9320;   // Which LCD is plugged in.

#define READ_SETUP_TIME 50
#define WRITE_SETUP_TIME 16

#define LCD_REG      (*((volatile unsigned short *) 0x60000000))
#define LCD_RAM      (*((volatile unsigned short *) 0x60020000))

// Work with the direct LCD RAM access & rotation
// Pick the always on bits based on the LCD.
#define R3_CMALWAYS_SET_ILI9320	  0x1000
#define R3_CMALWAYS_SET_ILI9325	  0x1000   /// *** DFM change 0x1030 for reversed text

#define R3_CMALWAYS_SET_SSD1289	  0x6800
#define R3_CMALWAYS_SET (s_currentLCD == LCD_ILI9320 ? R3_CMALWAYS_SET_ILI9320 :\
		                (s_currentLCD == LCD_ILI9325 ? R3_CMALWAYS_SET_ILI9325 : R3_CMALWAYS_SET_SSD1289))

#define R3_VERTICAL_BIT   5		// Set 0 for Increment, 1 for decrement
#define R3_HORIZONTAL_BIT 4		// Set 0 for Increment, 1 for decrement
#define R3_ADDRESS_BIT    3		// Set 1 for vertical, 0 for horizontal

#define R3_INCRCEMENT     1		// For X and Y directions.
#define R3_DECREMENT      0
#define R3_CHANGEADDR_X   0		// Does address change in X or Y first?
#define R3_CHANGEADDR_Y   1

/* Example: */
/* Set GRAM write direction and BGR = 1 */
/* I/D=00 (Horizontal : increment, Vertical : increment) */
/* AM=1 (address is updated in horizontal writing direction) */
#if LCD_ROTATION == 0
#define LCD_ROTATE_GETX(x,y) (x)
#define LCD_ROTATE_GETY(x,y) (y)
#define BUILD_R3_CMD(horizontalIncDec, verticalIncDec, addressDir) \
		(R3_CMALWAYS_SET | (verticalIncDec << R3_VERTICAL_BIT) | (horizontalIncDec << R3_HORIZONTAL_BIT) | (addressDir << R3_ADDRESS_BIT))
#elif LCD_ROTATION == 90
#define LCD_ROTATE_GETX(x,y) (y)
#define LCD_ROTATE_GETY(x,y) (LCD_ACTUAL_SCREEN_HEIGHT - (x) - 1)
#define BUILD_R3_CMD(horizontalIncDec, verticalIncDec, addressDir) \
		((R3_CMALWAYS_SET) | (!(horizontalIncDec) << R3_VERTICAL_BIT) | ((verticalIncDec) << R3_HORIZONTAL_BIT) | (!(addressDir) << R3_ADDRESS_BIT))
#elif LCD_ROTATION == 180
#define LCD_ROTATE_GETX(x,y) (LCD_ACTUAL_SCREEN_WIDTH - (x) - 1)
#define LCD_ROTATE_GETY(x,y) (LCD_ACTUAL_SCREEN_HEIGHT - (y) - 1)
#define BUILD_R3_CMD(horizontalIncDec, verticalIncDec, addressDir) \
		((R3_CMALWAYS_SET) | (!(verticalIncDec) << R3_VERTICAL_BIT) | (!(horizontalIncDec) << R3_HORIZONTAL_BIT) | ((addressDir) << R3_ADDRESS_BIT))
#elif LCD_ROTATION == 270
#define LCD_ROTATE_GETX(x,y) (LCD_ACTUAL_SCREEN_WIDTH - (y) - 1)
#define LCD_ROTATE_GETY(x,y) (x)
#define BUILD_R3_CMD(horizontalIncDec, verticalIncDec, addressDir) \
		((R3_CMALWAYS_SET) | ((horizontalIncDec) << R3_VERTICAL_BIT) | (!(verticalIncDec) << R3_HORIZONTAL_BIT) | (!(addressDir) << R3_ADDRESS_BIT))
#else
#error Must define LCD_ROTATION to be a direction
#endif

// Colours for Monochrome images.
__IO uint16_t LCD_textColor = 0x0000;
__IO uint16_t LCD_backColor = 0xFFFF;


// Private functions
static void TFT_Delay(uint32_t nTime);
static void LCD_Reset(void);
static void LCD_CtrlLinesConfig(void);
static void LCD_FSMCConfig(uint16_t setupTime);
static void TIM_Config(void);

void __assert_func(const char *file, int line, const char *assertFunc, const char *e)
{
	debug( LCD, "\n\n\n\n");
	debug( LCD, "******************************\n");
	debug( LCD, "ASSERT FAILED!\n");
	debug( LCD, "******************************\n");
	volatile int bugger = 0;
	while (1) {
		debug( LCD, "Assert failed:\n");
		debug( LCD, "   File %s, Line %d\n", file, line);
		debug( LCD, "   Function  %s\n", assertFunc);
		debug( LCD, "   Condition %s\n", e);
		bugger ++;
	}
}


//////////////////////////////////////////////////////////////////////////////////////////////////////
//		Initialization
//////////////////////////////////////////////////////////////////////////////////////////////////////

//#include "LcdDriver_SSD1289.h"
void LCDILI9320_Init(void);
void LCDSSD1289_Init(void);
void LCDILI9325_Init(void);

void LCD_Init(void)
{
	uint16_t version=0;

	// Configure the LCD IO before checking which chip we have:
	LCD_CtrlLinesConfig();
	TFT_Delay(20);

	LCD_Reset();
	TFT_Delay(20);

	LCD_FSMCConfig(READ_SETUP_TIME);
	TFT_Delay(20);

	version = LCD_ReadReg(0x0000);
	debug (LCD, "LCD Driver code: 0x%X\n", version);
	TFT_Delay(20);

	LCD_Reset();
	TFT_Delay(20);

	LCD_FSMCConfig(WRITE_SETUP_TIME);
	TFT_Delay(20);

	switch (version) {
	default:
		debug (LCD, "    Unknown LCD driver chip; defaulting to ILI9320...\n");
		assert(0);
		break;
		// Fall through to ILI9320
	case LCD_ILI9320:
		debug (LCD, "    Using ILI9320 configuration (matches code 0x%X)\n", LCD_ILI9320);
		s_currentLCD = LCD_ILI9320;
		LCDILI9320_Init();
		break;
	case LCD_ILI9325:
		debug (LCD, "    Using ILI9325 configuration (matches code 0x%X)\n", LCD_ILI9325);
		s_currentLCD = LCD_ILI9325;
		LCDILI9325_Init();
		break;
	case LCD_SSD1289:
	case LCD_SSD1289_ALT1:
	case LCD_SSD1289_ALT2:
		LCDSSD1289_Init();
		s_currentLCD = LCD_SSD1289;
		debug (LCD, "    Using SSD1289 configuration (matches codes 0x%X, 0x%X and 0x%X)\n", LCD_SSD1289, LCD_SSD1289_ALT1, LCD_SSD1289_ALT2);
		break;
	case LCD_ILI9328:
		debug (LCD, "    Using ILI9325 configuration (matches code 0x%X)\n", LCD_ILI9328);
		s_currentLCD = LCD_ILI9328;
		LCDILI9325_Init();
		break;

