iq32-sdr/Source/STM32-SDR/code/guiDrivers/src/LcdDriver_ILI9320.c
	}
}

/* ************************************************************************
 * BEGIN SSD1289 SECTION
 * ************************************************************************/
void LCDSSD1289_Init(void)
{
	TIM_Config();
	LCD_BackLight(100);

	LCD_WriteReg(0x0007,0x0021);    TFT_Delay(50); //?
	LCD_WriteReg(0x0000,0x0001);    TFT_Delay(50); //?
	LCD_WriteReg(0x0007,0x0023);    TFT_Delay(50); //?
	LCD_WriteReg(0x0010,0x0000);    TFT_Delay(90);
	LCD_WriteReg(0x0007,0x0033);    TFT_Delay(50); //?
	LCD_WriteReg(0x0011,0x6830);    TFT_Delay(50); //?
	LCD_WriteReg(0x0002,0x0600);    TFT_Delay(50);
	LCD_WriteReg(0x0012,0x6CEB);    TFT_Delay(50);
	LCD_WriteReg(0x0003,0xA8A4);    TFT_Delay(50);
	LCD_WriteReg(0x000C,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x000D,0x080C);    TFT_Delay(50);
	LCD_WriteReg(0x000E,0x2B00);    TFT_Delay(50);
	LCD_WriteReg(0x001E,0x00B0);    TFT_Delay(50); //?
	LCD_WriteReg(0x0001,0x2b3F);    TFT_Delay(50);  //RGB
	LCD_WriteReg(0x0005,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0006,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0016,0xEF1C);    TFT_Delay(50);
	LCD_WriteReg(0x0017,0x0103);    TFT_Delay(50); //?
	LCD_WriteReg(0x000B,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x000F,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0041,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0042,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0048,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0049,0x013F);    TFT_Delay(50);
	LCD_WriteReg(0x004A,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x004B,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0044,0xEF00);    TFT_Delay(50);
	LCD_WriteReg(0x0045,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0046,0x013F);    TFT_Delay(50);
	LCD_WriteReg(0x0030,0x0707);    TFT_Delay(50);
	LCD_WriteReg(0x0031,0x0204);    TFT_Delay(50);
	LCD_WriteReg(0x0032,0x0204);    TFT_Delay(50);
	LCD_WriteReg(0x0033,0x0502);    TFT_Delay(50);
	LCD_WriteReg(0x0034,0x0507);    TFT_Delay(50);
	LCD_WriteReg(0x0035,0x0204);    TFT_Delay(50);
	LCD_WriteReg(0x0036,0x0204);    TFT_Delay(50);
	LCD_WriteReg(0x0037,0x0502);    TFT_Delay(50);
	LCD_WriteReg(0x003A,0x0302);    TFT_Delay(50);
	LCD_WriteReg(0x002F,0x12BE);    TFT_Delay(50); //?
	LCD_WriteReg(0x003B,0x0302);    TFT_Delay(50);
	LCD_WriteReg(0x0023,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0024,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x0025,0x8000);    TFT_Delay(50);
	LCD_WriteReg(0x004f,0x0000);    TFT_Delay(50);
	LCD_WriteReg(0x004e,0x0000);    TFT_Delay(50);
}

/* ************************************************************************
 * END SSD1289 SECTION
 * ************************************************************************/


void LCDILI9320_Init()
{
	TIM_Config();
	LCD_BackLight(100);

	LCD_WriteReg(0x00E5, 0x8000); //
	LCD_WriteReg(0x0000, 0x0001);
	LCD_WriteReg(0x0001, 0x0100);
	LCD_WriteReg(0x0002, 0x0700);
	LCD_WriteReg(0x0003, 0x1030);
	LCD_WriteReg(0x0004, 0x0000);
	LCD_WriteReg(0x0008, 0x0202);
	LCD_WriteReg(0x0009, 0x0000);
	LCD_WriteReg(0x000A, 0x0000);
	LCD_WriteReg(0x000C, 0x0000);
	LCD_WriteReg(0x000D, 0x0000);
	LCD_WriteReg(0x000F, 0x0000);

	LCD_WriteReg(0x0010, 0x0000);
	LCD_WriteReg(0x0011, 0x0000);
	LCD_WriteReg(0x0012, 0x0000);
	LCD_WriteReg(0x0013, 0x0000);

	LCD_WriteReg(0x0010, 0x17B0);
	LCD_WriteReg(0x0011, 0x0037);
	TFT_Delay(50); // Delay 50ms
	LCD_WriteReg(0x0012, 0x013B);
	TFT_Delay(50); // Delay 50ms
	LCD_WriteReg(0x0013, 0x1800);
	LCD_WriteReg(0x0029, 0x000F);
	TFT_Delay(50); // Delay 50ms
	LCD_WriteReg(0x0020, 0x0000);
	LCD_WriteReg(0x0021, 0x0000);

	LCD_WriteReg(0x0030, 0x0000);
	LCD_WriteReg(0x0031, 0x0007);
	LCD_WriteReg(0x0032, 0x0103);
	LCD_WriteReg(0x0035, 0x0407);
	LCD_WriteReg(0x0036, 0x090F);
	LCD_WriteReg(0x0037, 0x0404);
	LCD_WriteReg(0x0038, 0x0400);
	LCD_WriteReg(0x0039, 0x0404);
	LCD_WriteReg(0x003C, 0x0000);
	LCD_WriteReg(0x003D, 0x0400);

	LCD_WriteReg(0x0050, 0x0000);
	LCD_WriteReg(0x0051, 0x00EF);
	LCD_WriteReg(0x0052, 0x0000);
	LCD_WriteReg(0x0053, 0x013F);
	LCD_WriteReg(0x0060, 0x2700);
	LCD_WriteReg(0x0061, 0x0001);
	LCD_WriteReg(0x006A, 0x0000);

	LCD_WriteReg(0x0080, 0x0000);
	LCD_WriteReg(0x0081, 0x0000);
	LCD_WriteReg(0x0082, 0x0000);
	LCD_WriteReg(0x0083, 0x0000);
	LCD_WriteReg(0x0084, 0x0000);
	LCD_WriteReg(0x0085, 0x0000);

	LCD_WriteReg(0x0090, 0x0010);
	LCD_WriteReg(0x0092, 0x0000);
	LCD_WriteReg(0x0093, 0x0003);
	LCD_WriteReg(0x0095, 0x0110);
	LCD_WriteReg(0x0097, 0x0000);
	LCD_WriteReg(0x0098, 0x0000);
	LCD_WriteReg(0x0007, 0x0173);
}


void LCDILI9325_Init()
{
	TIM_Config();
	LCD_BackLight(100);

    LCD_WriteReg(0xE5, 0x78F0); /* set SRAM internal timing */
    LCD_WriteReg(0x01, 0x0100); /* set Driver Output Control */
    LCD_WriteReg(0x02, 0x0700); /* set 1 line inversion */
    LCD_WriteReg(0x03, 0x1030); /* set GRAM write direction and BGR=1 */
    LCD_WriteReg(0x04, 0x0000); /* Resize register */
    LCD_WriteReg(0x08, 0x0207); /* set the back porch and front porch */
    LCD_WriteReg(0x09, 0x0000); /* set non-display area refresh cycle ISC[3:0] */
    LCD_WriteReg(0x0A, 0x0000); /* FMARK function */
    LCD_WriteReg(0x0C, 0x0000); /* RGB interface setting */
    LCD_WriteReg(0x0D, 0x0000); /* Frame marker Position */
    LCD_WriteReg(0x0F, 0x0000); /* RGB interface polarity */
    /*************Power On sequence ****************/
    LCD_WriteReg(0x10, 0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg(0x11, 0x0007); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LCD_WriteReg(0x12, 0x0000); /* VREG1OUT voltage */
    LCD_WriteReg(0x13, 0x0000); /* VDV[4:0] for VCOM amplitude */
    LCD_WriteReg(0x07, 0x0001);
    TFT_Delay(200);
    /* Dis-charge capacitor power voltage */
    LCD_WriteReg(0x10, 0x1090); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg(0x11, 0x0227); /* Set DC1[2:0], DC0[2:0], VC[2:0] */
    TFT_Delay(50);                          /* Delay 50ms */
    LCD_WriteReg(0x12, 0x001F);
    TFT_Delay(50);                          /* Delay 50ms */
    LCD_WriteReg(0x13, 0x1500); /* VDV[4:0] for VCOM amplitude */
    LCD_WriteReg(0x29, 0x0027); /* 04 VCM[5:0] for VCOMH */
    LCD_WriteReg(0x2B, 0x000D); /* Set Frame Rate */
    TFT_Delay(50);                          /* Delay 50ms */
    LCD_WriteReg(0x20, 0x0000); /* GRAM horizontal Address */
    LCD_WriteReg(0x21, 0x0000); /* GRAM Vertical Address */
    /* ----------- Adjust the Gamma Curve ---------- */
#if 1   /* the Gamma value may differ depending on batch, there are 3 groups for reference */
LCD_WriteReg(0x30, 0x0000);
LCD_WriteReg(0x31, 0x0603);
LCD_WriteReg(0x32, 0x0206);
LCD_WriteReg(0x35, 0x0206);
LCD_WriteReg(0x36, 0x0004);
LCD_WriteReg(0x37, 0x0105);
LCD_WriteReg(0x38, 0x0401);
LCD_WriteReg(0x39, 0x0707);
LCD_WriteReg(0x3C, 0x0602);
LCD_WriteReg(0x3D, 0x0004);
#endif
#if 0
    LCD_WriteReg(0x30, 0x0000);
    LCD_WriteReg(0x31, 0x0707);
    LCD_WriteReg(0x32, 0x0307);
    LCD_WriteReg(0x35, 0x0200);
    LCD_WriteReg(0x36, 0x0008);
    LCD_WriteReg(0x37, 0x0004);
    LCD_WriteReg(0x38, 0x0000);
    LCD_WriteReg(0x39, 0x0707);
    LCD_WriteReg(0x3C, 0x0002);
    LCD_WriteReg(0x3D, 0x1D04);
#endif
#if 0
LCD_WriteReg(0x30,0x0007);
LCD_WriteReg(0x31,0x0707);
LCD_WriteReg(0x32,0x0006);
LCD_WriteReg(0x35,0x0704);
LCD_WriteReg(0x36,0x1f04);
LCD_WriteReg(0x37,0x0004);
LCD_WriteReg(0x38,0x0000);
LCD_WriteReg(0x39,0x0706);
LCD_WriteReg(0x3c,0x0701);
LCD_WriteReg(0x3d,0x000f);
#endif
    /* ------------------ Set GRAM area --------------- */
    LCD_WriteReg(0x50, 0x0000); /* Horizontal GRAM Start Address */
    LCD_WriteReg(0x51, 0x00EF); /* Horizontal GRAM End Address */
    LCD_WriteReg(0x52, 0x0000); /* Vertical GRAM Start Address */
    LCD_WriteReg(0x53, 0x013F); /* Vertical GRAM Start Address */
    LCD_WriteReg(0x60, 0xA700); /* Gate Scan Line */
    LCD_WriteReg(0x61, 0x0001); /* NDL,VLE, REV */
    LCD_WriteReg(0x6A, 0x0000); /* set scrolling line */
    /* -------------- Partial Display Control --------- */
    LCD_WriteReg(0x80, 0x0000);
    LCD_WriteReg(0x81, 0x0000);
    LCD_WriteReg(0x82, 0x0000);
    LCD_WriteReg(0x83, 0x0000);
    LCD_WriteReg(0x84, 0x0000);
    LCD_WriteReg(0x85, 0x0000);
    /* -------------- Panel Control ------------------- */
    LCD_WriteReg(0x90, 0x0010);
    LCD_WriteReg(0x92, 0x0600);
    LCD_WriteReg(0x07, 0x0133); /* 262K color and display ON */
}

